fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <registerRecords>AccumulationRegister.ВКМ_ПлановыеОтпуска</registerRecords>
  <attributes>
    <name>Год</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/Forms/АнализГрафика/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(Параметры.АдресДанных)
		Или Не ЭтоАдресВременногоХранилища(Параметры.АдресДанных) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Отпуска = ПолучитьИзВременногоХранилища(Параметры.АдресДанных);
	
	Заголовок = СтрШаблон(НСтр("ru = 'Анализ графика отпусков на %1 год'"),
		Формат(Параметры.ГодГрафика, "ЧГ=0"));
	
	ЗаполнитьДиаграмму(Отпуска, Параметры.ГодГрафика);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьДиаграмму(Отпуска, ГодГрафика)
	
	Диаграмма.Обновление = Ложь;
	Диаграмма.Очистить();
	
	Если ЗначениеЗаполнено(ГодГрафика) Тогда
		Диаграмма.АвтоОпределениеПолногоИнтервала = Ложь;
		НачалоПериода = Дата(ГодГрафика, 1, 1);
		Диаграмма.УстановитьПолныйИнтервал(НачалоПериода, КонецГода(НачалоПериода));
	КонецЕсли;
	
	Серия = Диаграмма.УстановитьСерию(НСтр("ru = 'Отпуск'"));
	Серия.Текст = НСтр("ru = 'Отпуск'");
	
	ДнейПоСотрудникам = Новый Соответствие;
	
	Для Каждого СтрокаОтпуска Из Отпуска Цикл
		
		Если Не ЗначениеЗаполнено(СтрокаОтпуска.Сотрудник)
			Или Не ЗначениеЗаполнено(СтрокаОтпуска.ДатаНачала)
			Или Не ЗначениеЗаполнено(СтрокаОтпуска.ДатаОкончания) Тогда
			Продолжить;
		КонецЕсли;
		
		Дней = (НачалоДня(СтрокаОтпуска.ДатаОкончания) - НачалоДня(СтрокаОтпуска.ДатаНачала)) / 86400 + 1;
		
		Точка = Диаграмма.УстановитьТочку(СтрокаОтпуска.Сотрудник);
		ЗначениеДиаграммы = Диаграмма.ПолучитьЗначение(Точка, Серия);
		Интервал = ЗначениеДиаграммы.Добавить();
		Интервал.Начало = НачалоДня(СтрокаОтпуска.ДатаНачала);
		Интервал.Конец = КонецДня(СтрокаОтпуска.ДатаОкончания);
		Интервал.Текст = СтрШаблон("%1 - %2",
			Формат(СтрокаОтпуска.ДатаНачала, "ДФ=dd.MM"),
			Формат(СтрокаОтпуска.ДатаОкончания, "ДФ=dd.MM"));
		
		ТекущееКоличество = ДнейПоСотрудникам[СтрокаОтпуска.Сотрудник];
		Если ТекущееКоличество = Неопределено Тогда
			ТекущееКоличество = 0;
		КонецЕсли;
		ДнейПоСотрудникам.Вставить(СтрокаОтпуска.Сотрудник, ТекущееКоличество + Дней);
		
	КонецЦикла;
	
	// Подписи сотрудников с итогом дней отпуска.
	Для Каждого ЭлементСоответствия Из ДнейПоСотрудникам Цикл
		Точка = Диаграмма.УстановитьТочку(ЭлементСоответствия.Ключ);
		Точка.Текст = СтрШаблон(НСтр("ru = '%1 (%2 дн.)'"),
			ЭлементСоответствия.Ключ, ЭлементСоответствия.Значение);
	КонецЦикла;
	
	Диаграмма.Обновление = Истина;
	
КонецПроцедуры

#КонецОбласти
